# RBS Salary final Rank

In [1]:
import pandas as pd

In [2]:
salary = pd.read_csv('../Capstone_csv_file/salary_edited_to_fit_18-19')

In [3]:
rbs = pd.read_csv('../Capstone_csv_file/rbs_final_rank_18-19')

In [4]:
rbs

                  NAME  final_rank
0       Saquon Barkley         1.0
1            Joe Mixon         2.0
2           Nick Chubb         3.0
3      Phillip Lindsay         4.0
4          Todd Gurley         5.0
..                 ...         ...
91       Kenjon Barner        92.0
92    Jacquizz Rodgers        93.0
93  Deandre Washington        94.0
94       Wayne Gallman        95.0
95       Stevan Ridley        96.0

[96 rows x 2 columns]

In [5]:
rbs.set_index('NAME', inplace = True)

In [6]:
rbs_final_salary = rbs.merge(salary, on = 'NAME')

In [7]:
rbs_final_salary.set_index('NAME', inplace = True)

In [8]:
rbs_final_salary.head()

                final_rank    salary
NAME
Saquon Barkley         1.0   7798688
Joe Mixon              2.0   1362544
Nick Chubb             3.0   1845774
Todd Gurley            5.0  14375000
Derrick Henry          6.0   1351982

In [9]:
rbs_final_salary.to_csv('../Capstone_csv_file/rbs_final_salary_18-19')